["Wish you had an easy and private way to watch 4 better jobs? (Bitly URL to invisume)", "Stay in your job 2+ yrs & earn 50% less. Invisume.com keeps an eye out for you - privatly. ", "Want 2 earn more? ALWAYS keep an eye out 4 opportunity.  Invisume.com will do it free & like Han Solo says, “Real quiet like!”", "Wished you had a sports agent to always  be on the lookout for you for better jobs? Well, check out Invisume.com", "Every wonder if u missed your dream job because u don’t “job search”?  Invisume.com searches for u saving time & making u $ ", "Great sales people have jobs come to them. Invisume.com keeps your privacy so companies can apply to you!", "Think you’re worth more?  Want to find out, but don’t want to risk what you have? Invisume.com Free. Private. EZ.", "Wish you had 1) Better Boss 2) Higher pay 3) Better Opportunity ? Let it come to you! Invisume.com Jobs apply to you!", "Think you’re worth more? Find out for free and in PRIVATE with Invisume.com. Spend 20 minutes and always know your worth!", "Grass greener on the other side?  Want to peek and not be seen doing it? Invisume.com Free. Private. EZ.", "Shouldn’t jobs apply to you?  I mean, you’re talent, & companies need talent.  Invisume.com Jobs apply to you... as it should be.", "If u could spend 20 minutes tailoring a job search so someone always kept an eye out for you, would u? You can invisume.com", "Ever wish you could apply for all jobs with one application and first interview? We thought so, invisume.com Free. Private. EZ.", "If u wanted to know if a better job was out there, would u tell your boss? Post it online? No? Invisume.com so you don’t have to.", "Will u retire at your current job? If not, what if u had a free & private scout for the next great thing for you? Invisume.com will.", "Do you know if you’re worth more in the open market?  Now you can find out … and ALWAYS know - privately. Invisume.com", "Your company has a plan should you leave, what if they leave you? invisume.com Free. Private. EZ.", "Shouldn’t there be privacy in job search? Now there is check out invisume.com Free. Private. EZ.", "If your company leaves u, beyond early retirement, what’s your backup plan? invisume.com would love 2 be a free one for u!", "Got a family?  You get life insurance.  Got a job?  Wish they had job insurance?  invisume.com is like job insurance.", "You know exceptional sales professionals loses about 10K in a layoff scenario? Can happen 2 anyone. Invisume.com protects u", "If you got laid off, wouldn’t months of a head start be great? What if it only cost u 20 minutes?  Invisume.com Free. EZ. Private.", "Ever wonder what u would do if your company went south? Wouldn’t it be better if jobs found u? Invisume.com handles this 4 u.", "Always wanted a “sports agent” to keep an eye out for you just in case?  Yeah, we thought so… check out Invisume.com ", "U know the ave unemployment rate is now longer than during the great recession?  Invisume.com helps protect you just in case.", "Wish you could apply to 100 places at once but NOT give your name? Now you can, invisume.com free, private, EZ", "You know what you get if you join Invisume.com for free?  Only piece of mind. Job Find @yourinvisume Free. Private. EZ.", "Best time to borrow $? When u don’t need it. Best time to get a job? When u have one. Invisume.com Free. Private. EZ.", "Happy at work? Great! Stay. But if your job leaves u, have a back up plan.  Invisume.com Private. Free. EZ.", "Every application is a risk.  Every job interview, a risk.  Every resume post, a risk. Invisume.com 100% private, no risk.", "What’s riskier looking for a job or NOT always looking? Why do you have choose?  You don’t - Invisume.com Private. Free. EZ.", "How’s your job security? Do u control your boss? Product? Service? Investors / stock price? Control your options invisume.com", "Could u afford to lose a months salary if u were laid off?  How about 3 months? Invisume.com always has u in market, privatly.", "Privacy matter in job search? What is riskier, your job & time looking or not having back up plan? Invisume.com = no risk.  ", "What’s your contingency plan to your job? They have one if you leave. Invisivume.com is Free, Private, & EZ.", "Wish you had a better job, but don’t want to risk your current one? Invisume.com is the Free, Private, & EZ way to do it!", "A study says 98% of people would consider a new job if they knew it was better. Now you can know with Invisume.com", "Know anyone looking for a job, but concerned for their privacy?  Tell them about www.invisume.com", "Got a friend in sales that doesn’t fit your company, but you want to refer?  Refer invisume.com - Free, Private, EZ.", "Know a great salesperson? Tell them about Invisume.com - free, private, ez where jobs apply to u.  ", "We won’t ask via social media 4 things that should be done in private, but isn't job search one? invisume.com Free. Private. EZ.", "U know u have more privacy in shopping for shoes than jobs? Yeah, ridiculous. Invisume.com = not rediculous. Private Job Find", "Is there anything about the phrase “job search” that sounds appealing to you? Invisume.com is job find.  Free. EZ. Private.", "Did u hear joining Invisume.com 4 free private job search can win u a new car? No? Good, it can’t. But it can get u a great job!", "Ever spend 20 minutes on a resume & have it apply & interview for you? Didn’t think so. Invisume.com not magical, just better.", "Any salesperson u hated working with? Don’t tell them about Invisume.com they might make more money...and it’s free..and EZ.", "Just cuz Payton’s career looks over, doesn't mean yours is. Always be a free agent, privately invisume.com Free", "2 lazy 4 job search? 2 good 4 job search? Both? Great, you’re out kinda people. Invisue.com Free. Private. EZ. Jobs apply to u!", "Have your friends introduced you to Invisume.com yet? NO?!?! Are they really your friends? Job Find - Free. Private. EZ."]